package exam;

import java.util.Scanner;

/*Напишите программу, в которой создается одномерный числовой
массив и заполняется числами, которые при делении на 5 дают в остатке 2
(числа 2, 7,12,17 и так далее). Размер массива вводится пользователем.
Предусмотреть обработку ошибки, связанной с вводом некорректного
значения.
*/
public class E11 {
    public static void main(String[] args) {
        System.out.println("Введите размер массива");
        Scanner in = new Scanner(System.in);
        int Size = in.nextInt();
        if(Size>0) {
            int [] nums = new int [Size];
            int x =0;
            int i = 0;
        }}
        }
